In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.2.4
1.20.1

In [2]:
n_rows = 10
n_cols = 1
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1, 99, size = (n_rows , n_cols)),
                 columns=cols)
df

   usia
0    79
1    44
2    67
3    29
4    34
5    96
6     5
7    49
8     6
9    34

In [3]:
# Pengelompollan nilai numerik ke dalam beberapa kategori menggunakan cut()

In [5]:
df['kelompok_usia'] = pd.cut(df['usia'],
                            bins = [0, 18, 65, 99],
                            labels = ['anak', 'dewasa', 'manula'])
df

   usia kelompok_usia
0    79        manula
1    44        dewasa
2    67        manula
3    29        dewasa
4    34        dewasa
5    96        manula
6     5          anak
7    49        dewasa
8     6          anak
9    34        dewasa

In [6]:
# Persiapan Data Frame

In [8]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size = (n_rows , n_cols)),
                 columns=cols)
df.head()

    A   B   C   D   E
0   7  15  19  16   9
1   9  17   4  14   1
2  16   4   3  12   3
3   3  16  15  18  15
4  15  18  10   7  10

In [9]:
df1 = df.copy(deep = True)
df1 = df1.drop([1, 4])
df1

    A   B   C   D   E
0   7  15  19  16   9
2  16   4   3  12   3
3   3  16  15  18  15

In [10]:
df2 = df.copy(deep = True)
df2 = df2.drop([0, 3])
df2

    A   B   C   D   E
1   9  17   4  14   1
2  16   4   3  12   3
4  15  18  10   7  10

In [ ]:
# Menggabungkan dua Data Frame

In [11]:
df_inner = pd.merge(df1, df2, how='inner')
df_inner

    A  B  C   D  E
0  16  4  3  12  3

In [12]:
df_outer = pd.merge(df1, df2, how='outer')
df_outer

    A   B   C   D   E
0   7  15  19  16   9
1  16   4   3  12   3
2   3  16  15  18  15
3   9  17   4  14   1
4  15  18  10   7  10

In [13]:
# Persiapan Data Frame

In [37]:
data = {'nama':['Didi Kempot', 'Glenn Fredly', 'Mbah Surip'],
       'tempat kelahiran': ['Surakarta , Jawa Tengah', 'Jakarta , DKI Jakarta','Mojokerto , Jawa Timur']}

df = pd.DataFrame(data)
df

           nama         tempat kelahiran
0   Didi Kempot  Surakarta , Jawa Tengah
1  Glenn Fredly    Jakarta , DKI Jakarta
2    Mbah Surip   Mojokerto , Jawa Timur

In [ ]:
# memecah nama depan dan nama belakang

In [38]:
df[['nama_depan', 'nama_belakang']] = df['nama'].str.split(' ', expand=True)
df

           nama         tempat kelahiran nama_depan nama_belakang
0   Didi Kempot  Surakarta , Jawa Tengah       Didi        Kempot
1  Glenn Fredly    Jakarta , DKI Jakarta      Glenn        Fredly
2    Mbah Surip   Mojokerto , Jawa Timur       Mbah         Surip

In [20]:
# memecah nama kota dan propinsi

In [40]:
df[['kota', 'propinsi']] = df['tempat kelahiran'].str.split(',', expand=True)
df

,nama,tempat kelahiran,nama_depan,nama_belakang,kota,propinsi
0,Didi Kempot,"Surakarta , Jawa Tengah",Didi,Kempot,Surakarta,Jawa Tengah
1,Glenn Fredly,"Jakarta , DKI Jakarta",Glenn,Fredly,Jakarta,DKI Jakarta
2,Mbah Surip,"Mojokerto , Jawa Timur",Mbah,Surip,Mojokerto,Jawa Timur

In [41]:
# Persiapan Data Frame

In [ ]:
df = pd.read_csv('./data/titanicfull.csv')
sf.head()

In [ ]:
# Data Frame degan multiple indexes dari hasil groupping

In [ ]:
df.groupby(['sex', 'pclass'])['survived'].mean().to_frame()

In [42]:
# Menata ulang Data Frame dengan multiple indexes

In [ ]:
df.groupby(['sex', 'pclass'])['survived'].mean().unstack()